---
title: ConnectionValidationInfo
classe: Autodesk.Revit.DB.ConnectionValidationInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ConnectionValidationInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `connectionValidationInfo.IsValidObject` | Boolean |
| `Void Dispose()` | `connectionValidationInfo.Dispose()` | Void |
| `ConnectionValidationWarning GetWarning(Int32)` | `connectionValidationInfo.GetWarning(index)` | ConnectionValidationWarning |
| `Boolean IsValidWarningIndex(Int32)` | `connectionValidationInfo.IsValidWarningIndex(index)` | Boolean |
| `Int32 ManyWarnings()` | `connectionValidationInfo.ManyWarnings()` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```